public class Main {
    public static void main(String[] args) {
        task1();
        task2();
    }

    public static void task1() {
        // Домашнее задание 1
        System.out.println("Домашнее задание 1");
        // Задача 1
        System.out.println("Задача 1");
        // С помощью цикла while посчитайте, сколько месяцев потребуется,
        // чтобы накопить 2_459_000 рублей при условии,
        // что первоначально мы имеем 0 рублей и готовы откладывать по 15 тысяч рублей.
        //
        //Результат программы должен быть выведен в консоль в формате
        // "Месяц … , сумма накоплений равна … рублей" с тем количеством месяцев,
        // необходимым для накопления данной суммы.
        int salary = 15_000;
        int total = 0;
        int i = 0;
        while (total < 2_459_000) {
            i ++;
            total = total + salary;
            System.out.println("Месяц " + i + ", сумма накоплений = " + total +  "рублей");
        }
        System.out.println(total);

        // Задача 2
        System.out.println("Задача 2");
        //Выведите в одну строку через пробел числа от 1 до 10, используя цикл while.
        //
        //На следующей строке выведите числа в обратном порядке от 10 до 1, используя оператор for.
        //
        //Для обоих циклов можно использовать как одну общую переменную, так и в каждом цикле свою.
        //
        //Не забудьте выполнить переход на новую строку между двумя циклами.
        //
        //В результате программы вывод должен получиться следующий:
        //
        //1 2 3 4 5 6 7 8 9 10
        //
        //10 9 8 7 6 5 4 3 2 1
        int j = 0;
        while (j < 10) {
            j++;
            System.out.print(j + " ");
        }
        System.out.println();

        for (int k = 10; k > 0  ; k--) {
                System.out.print(k + " ");
        }
        System.out.println();
        // Задача 3
        System.out.println("Задача 3");
        //В стране Y население равно 12 миллионам человек.
        //
        //За год рождаемость составляет 17 человек на 1000 человек,
        // смертность - 8 человек.
        // Рассчитайте, какая численность населения будет через 10 лет,
        // принимая во внимание, что показатели рождаемости и смертности постоянны.
        //
        //В консоль выведите результат операции на каждый год в формате
        // "Год …, численность населения составляет … "
        //
        //Критерии проверки
        int populationCountryY = 12_000_000;
        int totalPopulation =0;
        for (int k = 0; k <= 10; k++) {
            totalPopulation = populationCountryY + totalPopulation;
            totalPopulation = populationCountryY + totalPopulation / 1_000 * (17 - 9);
            System.out.println("Год " + k + ", численность населения составляет " + totalPopulation);
        }

    }
    public static void task2() {
        // Домашнее задание 2
        System.out.println("Домашнее задание 2");
        // Задача 1
        System.out.println("Задача 1");
        //Условие
        //Напишите программу, которая выводит в консоль сумму накоплений.
        //
        //Василий решил положить деньги на накопительный счет,
        // где каждый месяц к сумме его вклада добавляется ещё 7%.
        //
        //Первоначальная сумма вклада Василия составляет 15 тысяч рублей.
        //
        //Задание 1
        //Вычислите и выведите в консоль, сколько месяцев Василию нужно будет копить,
        // чтобы собрать сумму в 12 миллионов рублей при условии,
        // что процент банка от накоплений не меняется,
        // а всегда равен 7%.
        // Выведите в консоль результат программы с указанием суммы накоплений по каждому месяцу.
        // Задание 2
                System.out.println("Задача 2");
        //        //Видоизмените программу таким образом,
        //        // чтобы в консоль выводились не все месяцы подряд,
        //        // а только каждый шестой.
        //        // Должны быть видны накопления за 6, 12, 18, 24 и далее месяцы.

        float desiredAmount = 15_000;
        for (int i = 1; desiredAmount <= 12_000_000; i++) {
            float percent = desiredAmount/100*7;
            desiredAmount += percent;
            if (i % 6 == 0) {
                System.out.println(i + " месяц сумма накоплений равна " + desiredAmount);
            }
        }
        System.out.println(desiredAmount);
        //Задание 3
        System.out.println("Задание 3");
        //Василий решил год копить деньги ближайшие 9 лет.
        // И он хочет знать, какой будет сумма его накоплений каждые полгода
        // на протяжении этих 9 лет.
        //
        //Исходная сумма всё так же 15 тысяч рублей, проценты банка – 7% ежемесячно.
        //
        //Напишите программу, которая будет выводить Василию сумму его накоплений
        // за следующие каждые полгода в течение 9 лет.
        for (int i = 1; i <=108; i++) {
            float percent = desiredAmount/100*7;
            desiredAmount += percent;
            if (i % 6 == 0) {
                System.out.println(i + " месяц сумма накоплений равна " + desiredAmount);
            }
        }
        // Задание 4
        System.out.println("Задача 4");
        //В вашей компании пятница является днем отчетным.
        //
        //Нам нужно написать программу, которая считает дни месяца по датам,
        // определяет, какой день пятница, и выводит сообщение с напоминанием,
        // что нужно подготовить еженедельный отчет.
        //
        //Условия задачи:
        //
        //Создайте переменную типа int, которая хранит в себе номер первой пятницы месяца
        // (число от 1 до 7).
        //
        //Выведите на каждую пятницу месяца (включая полученную) сообщение следующего вида:
        //
        //"Сегодня пятница, ...-е число. Необходимо подготовить отчет."
        //
        //В нашем месяце 31 день. В результате у вас должно вывестись
        // от 4 до 5 сообщений с напоминаниями по разным датам.
        System.out.println("Задача 4");
        int friday = 4;
        for (int i = 4; i <= 31 ; i = i + 7) {
                System.out.println("Сегодня пятница, " + i + "-е число. " +
                        "Необходимо подготовить отчет.");
            System.out.println("Домашка выполнена");
        }
    }

}