public class Main {
    public static void main(String[] args) {
        task1();

        // Домашнее заданте 1
        // Задача 1
        // С помощью цикла while посчитайте, сколько месяцев потребуется,
        // чтобы накопить 2 459 000 рублей при условии,
        // что первоначально мы имеем 0 рублей и готовы откладывать по 15 тысяч рублей.
        //
        //Результат программы должен быть выведен в консоль в формате
        // "Месяц … , сумма накоплений равна … рублей" с тем количеством месяцев,
        // необходимым для накопления данной суммы.

        System.out.println("Задача 1");
    }

    public static void task1() {


    }

}